# Install command-line tools using Homebrew
# Usage: `brew bundle`

# mac app store
brew 'mas'
mas 'Xcode', id: 497799835
mas 'Slack', id: 803453959

# replace default openssl
brew 'openssl'

# shell
brew 'zsh'
brew 'zsh-completions'

# terminal
cask 'iterm2'

# git
brew 'git'
brew 'git-extras'
cask 'gitup'
brew 'gpg'

## development languages
# ruby with version manager
brew 'chruby'
brew 'ruby-install'
# node
brew 'node'
brew 'yarn'
# other
brew 'python'
brew 'go'
brew 'scala'
brew 'elixir'
brew 'terraform'

# database client tools and libs
brew 'postgresql'
brew 'redis'
brew 'rabbitmq'
brew 'memcached'

# utils
brew 'coreutils'
brew 'ripgrep'
brew 'fasd'
brew 'fzf'
brew 'wget'
brew 'curl'
brew 'ccat'
brew 'awscli'
brew 'terminal-notifier'
brew 'forego'
brew 'jq'

# heroku
tap 'heroku/brew'
brew 'heroku'

# editor
brew 'macvim'

# development font
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'

# apps
cask 'utm'
cask 'visual-studio-code'
cask 'zoom'
cask 'authy'
cask 'drawio'

# docker for mac
brew 'docker'
brew 'docker-compose'
brew 'colima'
